c5/src/Documents/IncomingEmail/IncomingEmail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>IncomingEmail</name>
  <posting>Deny</posting>
  <attributes>
    <name>AttachmentsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Brief</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Cc</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Importance</name>
    <type>
      <types>EnumRef.Importance</types>
    </type>
  </attributes>
  <attributes>
    <name>Key</name>
    <type>
      <types>CatalogRef.MailKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Mailbox</name>
    <type>
      <types>CatalogRef.Mailboxes</types>
    </type>
  </attributes>
  <attributes>
    <name>MessageID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Received</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Receiver</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiverName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplyTo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sender</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SenderName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerMessageID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Size</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Attachments</name>
    <attributes>
      <name>Extension</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>File</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Size</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Emails</name>
    <attributes>
      <name>Email</name>
      <type>
        <types>DocumentRef.IncomingEmail</types>
        <types>DocumentRef.OutgoingEmail</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/OutgoingEmail/OutgoingEmail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>OutgoingEmail</name>
  <attributes>
    <name>AttachmentsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Brief</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Cc</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Importance</name>
    <type>
      <types>EnumRef.Importance</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomingEmail</name>
    <type>
      <types>DocumentRef.IncomingEmail</types>
    </type>
  </attributes>
  <attributes>
    <name>Key</name>
    <type>
      <types>CatalogRef.MailKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Mailbox</name>
    <type>
      <types>CatalogRef.Mailboxes</types>
    </type>
  </attributes>
  <attributes>
    <name>MessageID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Receiver</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiverName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplyTo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sender</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SenderName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerMessageID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Size</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Table</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>TableDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TableType</name>
    <type>
      <types>EnumRef.TableTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Attachments</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Extension</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>File</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Size</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Emails</name>
    <attributes>
      <name>Email</name>
      <type>
        <types>DocumentRef.IncomingEmail</types>
        <types>DocumentRef.OutgoingEmail</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/HTTPServices/Email/Module.bsl
Function BodyGet ( Request )
	
	SetPrivilegedMode ( true );
	p = getParams ();
	fetchParams ( p, Request );
	html = getHTML ( p );
	response = new HTTPServiceResponse ( 200 );
	response.SetBodyFromString ( html );
	return response;
	
EndFunction

Function getParams ()
	
	p = new Structure ();
	p.Insert ( "ID" );
	p.Insert ( "Incoming" );
	return p;
	
EndFunction 

Procedure fetchParams ( Params, Request )
	
	p = Conversion.MapToStruct ( Request.QueryOptions );
	FillPropertyValues ( Params, p );
	
EndProcedure 

Function getHTML ( Params )
	
	id = new UUID ( Params.ID );
	document = ? ( Params.Incoming = "1", Documents.IncomingEmail, Documents.OutgoingEmail );
	email = document.GetRef ( id );
	fields = DF.Values ( email, "MessageID, Mailbox" );
	return EmailsSrv.GetHTML ( email, fields.MessageID, fields.Mailbox, , true );

EndFunction
